/**/
"Cancel" = "Avbryt";
/**/
"Delete" = "Ta bort";
/**/
"Open" = "Öppna";
/**/
"Edit" = "Redigera";
/**/
"Yes" = "Ja";
/**/
"Finish" = "Slutför";
/**/
"Done" = "Klar";
/**/
"Save" = "Spara";
/**/
"Undo" = "Ångra";
/**/
"Redo" = "Upprepa";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Använd geometri";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Rensa geometri";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Ta bort vertex";
/*Geometry Edit Action Name*/
"Insert Part" = "Infoga del";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Infoga brytpunkt";
/*Geometry Edit Action Name*/
"Move Vertex" = "Flytta brytpunkt";
/*Geometry Edit Action Name*/
"Remove Part" = "Ta bort del";

/*Collecting attachments*/
"Add" = "Lägg till";
/*Collecting attachments*/
"Take Photo or Video" = "Ta bild eller video";
/*Collecting attachments*/
"Choose From Library" = "Välj från bibliotek";
/*Collecting attachments*/
"Photo" = "Fotografi";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Spara till bildbibliotek";
/*Collecting attachments*/
"Download" = "Hämta";

/*Date attribute*/
"Today" = "Idag";

/**/
"Attachments" = "Bilagor";
"Attributes" = "Attribut";

/**/
"Open in Safari" = "Öppna i Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Ange en siffra mellan %i och %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Ange en siffra mellan %@ och %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "För många tecken (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Siffran ligger ej inom godkänd intervall.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Filtypen stöds inte";

/**/
"%d of %d" = "%d av %d";

/**/
"Changing Feature Type" = "Ändra funktionstyp";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Du ändrar funktionstypen, vilket eventuellt kan skriva över vissa fältvärden. Är du säker på att du vill fortsätta?";

/**/
"Data for pie chart is invalid" = "Data för cirkeldiagrammet är ogiltiga";
"No data to create a pie chart" = "Det finns inga data för att skapa ett cirkeldiagram";

/**/
"Created by %@ seconds ago" = "Skapades av %@ för några sekunder sedan";

/**/
"Created by %@ a minute ago" = "Skapades av %@ för en minut sedan";

/**/
"Edited by %@ seconds ago" = "Redigerades av %@ för några sekunder sedan";

/**/
"Edited by %@ a minute ago" = "Redigerades av %@ för en minut sedan";

/**/
"Created seconds ago" = "Skapades för några sekunder sedan";

/**/
"Created a minute ago" = "Skapades för en minut sedan";

/**/
"Edited seconds ago" = "Redigerades för några sekunder sedan";

/**/
"Edited a minute ago" = "Redigerades för en minut sedan";

/**/
"Created by %@ %d minutes ago" = "Skapades av %@ %d minuter sedan";

/**/
"Created by %@ an hour ago" = "Skapades av %@ för en timme sedan";

/**/
"Created by %@ %d hours ago" = "Skapades av %@ %d timmar sedan";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Skapades av %@ %@ kl %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Skapades av %@ %@ kl %@";

/**/
"Edited by %@ %d minutes ago" = "Redigerades av %@ %d minuter sedan";

/**/
"Edited by %@ an hour ago" = "Redigerades av %@ för en timme sedan";

/**/
"Edited by %@ %d hours ago" = "Redigerades av %@ %d timmar sedan";

/**/
"Edited by %@ on %@ at %@ - day" = "Redigeras av %@ %@ kl %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Redigeras av %@ %@ kl %@";

/**/
"Created by %@" = "Skapades av %@";

/**/
"Edited by %@" = "Redigerades av %@";

/**/
"Created %d minutes ago" = "Skapades för %d minuter sedan";

/**/
"Created an hour ago" = "Skapades för en timme sedan";

/**/
"Created %d hours ago" = "Skapades för %d timmar sedan";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Skapades %@ kl %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Skapades %@ kl %@";

/**/
"Edited %d minutes ago" = "Redigerades för %d minuter sedan";

/**/
"Edited an hour ago" = "Redigerade för en timme sedan";

/**/
"Edited %d hours ago" = "Redigerades för %d timmar sedan";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Redigerades %@ kl %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Redigerades %@ kl %@";

/* Used to denote a required field */
"Required" = "Obligatoriskt";

/* Used for naming layers with no names */
"Layer %d" = "Lager %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Det går inte att hitta adressen för platsen";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Det går inte att hitta plats för adressen";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Det går inte att läsa adressen";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Det gick inte att hitta filen";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Det går inte att läsa in placeringsfilen";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Internt fel för placeringsfilen";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Geokodning för korsningar stöds inte av placeringsfilen";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Ogiltiga egenskaper för placeringsfilen";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Obligatoriskt fält saknas";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Placeringsfilen har inte initierats";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Placeringsfilens format stöds inte";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Projektionsomvandlingen stöds inte";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Den geografiska referensen stöds inte";

/* Network analyst errors */
"Cannot open network." = "Det går inte att öppna nätverket.";
"Cannot retrieve route task parameters." = "Det går inte att hämta parametrar för ruttåtgärden.";
"Insufficient number of stops." = "För få stopp.";
"Stop (%@) was not located." = "Stopp (%@) gick inte att hitta.";
"Stop (%@) is located on a non traversable element." = "Stopp (%@) ligger på ett oframkomligt element.";
"Stop (%@) is located on a soft restricted element." = "Stopp (%@) ligger på ett element med mjuk begränsning.";
"Point barrer (%@) was not located." = "Punkthindret (%@) gick inte att hitta.";
"Point barrier (%@) has invalid added cost attribute name." = "Punkthindret (%@) har ogiltigt attributnamn för tillagd kostnad.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Linjehindret (%@) har ogiltigt attributnamn för skalad kostnad.";
"Line barrier (%@) does not cover any network elements." = "Linjehindret (%@) täcker inga nätverkselement.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygonhindret (%@) har ogiltigt attributnamn för skalad kostnad.";
"Polygon barrier (%@) does not cover any network elements." = "Polygonhindret (%@) täcker inga nätverkselement.";
"'%@' is an invalid impedance attribute." = "'%@' är ett ogiltigt impedansattribut.";
"'%@' restriction attribute is invalid." = "'%@' begränsningsattribut är ogiltigt.";
"'%@' accumulate attribute is invalid." = "'%@' ackumuleringsattribut är ogiltigt.";
"'%@' is an invalid directions time attribute." = "'%@' är ett ogiltigt attribut för vägbeskrivningstid.";
"Directions distance attribute is invalid." = "Attributet för vägbeskrivningsavstånd är ogiltigt.";
"Invalid attribute parameter attribute name (%@)." = "Ogiltigt attributnamn för attributparameter (%@).";
"Invalid attribute parameter parameter name (%@)." = "Ogiltigt parameternamn för attributparameter (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Ogiltig värdetyp för attribut (%1$@) parameter (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Ogiltigt begränsningsanvändningsvärde för attribut (%1$@) parameter (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutralt begränsningsanvändningsvärde för attribut (%1$@) parameter (%2$@).";
"Soft restricted element (%@) was traversed." = "Mjukt begränsat element (%@) korsades.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Nätverket behöver inte ha något hierarkiattribut för att utföra hierarkisk ruttplanering.";
"No path can be found between a given pair of stops (%@)." = "Det går inte att hitta någon väg mellan ett angivet par stopp (%@).";
"The input spatial reference is undefined." = "Den geografiska indatareferensen är odefinierad.";
"The output spatial reference is undefined." = "Den geografiska utdatareferensen är odefinierad.";
"The directions style is invalid." = "Vägbeskrivningsstilen är ogiltig.";
"The directions language is invalid." = "Vägbeskrivningsspråket är ogiltigt.";
"Directions time and distance attributes do not match." = "Attributen för vägbeskrivningens tid och avstånd matchar inte.";
"The directions road class attribute is invalid." = "Attributet för vägbeskrivningens vägklass är ogiltigt.";
"Unknown condition." = "Okänt villkor.";
"Invalid route task parameters." = "Ogiltiga ruttåtgärdsparametrar.";
"Route task's solution cannot be found." = "Det går inte att hitta ruttåtgärdens lösning.";
"Route task was cancelled." = "Ruttåtgärden avbröts.";
"Route task internal error." = "Internt fel för ruttåtgärd.";
"Route name property is not supported for local route task." = "Ruttnamnsegenskapen stöds inte för lokala rutter.";
"Local route task parameters should be retrieved from route task." = "Parametrar för lokala ruttåtgärder bör hämtas från ruttåtgärden.";
"Cannot retrieve network description." = "Det går inte att hämta nätverksbeskrivningen.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Du kan endast ange ett längdattribut för impedanceAttributeName och accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Du kan endast ange ett tidsattribut för impedanceAttributeName och accumulateAttributeNames.";
"Service not supported." = "Tjänsten stöds inte.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "tum";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "M";
"pt" = "pt";
"Unknown" = "Okänt";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimeter";
"Decimal Degrees" = "Decimalgrader";
"Decimeters" = "Decimeter";
"Feet" = "Fot";
"Inches" = "Tum";
"Kilometers" = "Kilometer";
"Meters" = "Meter";
"Miles" = "Mile";
"Millimeters" = "Millimeter";
"Nautical Miles" = "Nautiska mil";
"Points" = "Punkter";
"Yards" = "Yard";

/* Area Units Abbreviated Strings */
"sq. in" = "kv.tum";
"sq. ft" = "kv.fot";
"sq. yd" = "kv.yd";
"ac" = "ac";
"sq. mi" = "eng. kv.miles";
"sq. mm" = "kv.mm";
"sq. cm" = "kv.cm";
"sq. dm" = "kv.dm";
"sq. m" = "kv.m";
"ares" = "ar";
"ha" = "ha";
"sq. km" = "kv.km";

/* Area Units Display Strings */
"Square Inches" = "Kvadrattum";
"Square Feet" = "Kvadratfot";
"Square Yards" = "Kvadratyards";
"Acres" = "Tunnland";
"Square Miles" = "Kvadratmil (engelska)";
"Square Millimeters" = "Kvadratmillimeter";
"Square Centimeters" = "Kvadratcentimeter";
"Square Decimeters" = "Kvadratdecimeter";
"Square Meters" = "Kvadratmeter";
"Ares" = "Ar";
"Hectares" = "Hektar";
"Square Kilometers" = "Kvadratkilometer";

/* Errors */
"Class not @protocol AGSCoding compliant" = "Klassen är inte kompatibel med @protocol AGSCoding";
"Authorization required" = "Auktorisering krävs";
"Token is invalid or has expired" = "Token är ogiltig eller har upphört";
"Unknown error occurred" = "Ett okänt fel har inträffat";
"Empty username/password" = "Tomt användarnamn/lösenord";
"Token URL is nil. You must set a valid token URL on the credential." = "Token-URL är noll. Du måste ange en giltig token-URL i inloggningsuppgifterna.";
"Unknown authentication error" = "Okänt autentiseringsfel";
"Error extracting identity" = "Fel vid extrahering av identitet";
"Error adding identity to the keychain" = "Fel när identiteten lades till i nyckelkedjan";
"Invalid Credentials" = "Felaktiga inloggningsuppgifter";
"Bad URL." = "Ogiltig URL.";
"The feature layer does not expose an object-id field." = "Geoobjektlagret visar inget objekt-ID-fält.";
"Both geodatabase and syncParams are required for this method." = "Både geodatabasen och syncParams krävs för den här metoden.";
"Uploading deltas is not supported with this replica." = "Det finns inte stöd för att läsa in delta med den här kopian.";
"Error creating delta geodatabase" = "Det gick inte att skapa deltageodatabas";
"Unable to create result image layer" = "Det gick inte att skapa resultatbildlager";
"Cache at path '%@' not found." = "Det gick inte att hitta cache med sökvägen '%@'.";
"To add an item, you must be logged in to the portal." = "Du måste vara inloggad på portalen för att lägga till ett objekt.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Du måste ange ett värde i AGSPortalItemContentParameters för att lägga till ett objekt.";
"The portal failed to add the item." = "Portalen kunde inte lägga till objektet.";
"To delete an item, you must be logged in to the portal." = "Du måste vara inloggad på portalen för att ta bort ett objekt.";
"The portal failed to delete the item." = "Portalen kunde inte ta bort objektet.";
"To update an item, an itemId and logged in user are required." = "Om du vill uppdatera ett objekt krävs ett itemId och en inloggad användare.";
"The item failed to update." = "Det gick inte att uppdatera objektet.";
"The item failed to update JSON." = "Objektet kunde inte uppdatera JSON.";
"You must be logged in to a portal to add a comment." = "Du måste vara inloggad på en portal för att lägga till en kommentar.";
"The comment failed to be added." = "Det gick inte att lägga till en kommentar.";
"You must be logged in to a portal to fetch the current user's rating." = "Du måste vara inloggad på en portal för att hämta den aktuella användarens betyg.";
"You must be logged in to a portal to add a rating." = "Du måste vara inloggad på en portal för att lägga till ett betyg.";
"The rating failed to be added." = "Det gick inte att lägga till betyget.";
"To share an item, you must be logged in to the portal." = "Du måste vara inloggad på portalen för att dela ett objekt.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "För att sluta dela ett objekt måste du vara inloggad på portalen och ange grupper som du ska sluta dela objektet med.";
"Bad Request" = "Ogiltig begäran";
"Credential Required" = "AGSCredential krävs";
"Job not created" = "Jobbet har inte skapats";
"Service did not return a valid URL" = "Tjänsten returnerade inte en giltig URL";
"Service did not return a file" = "Tjänsten returnerade inte en fil";
"Service did not return a size" = "Tjänsten returnerade inte en storlek";
"Job failed" = "Jobbet misslyckades";
"Job timed out" = "Tidsgränsen för jobbet har nåtts";
"Job was cancelled" = "Jobbet avbröts";
"Job was deleted" = "Jobbet har tagits bort";

/* OAuth */
"The specified clientID is invalid" = "Angivet clientID är ogiltigt";











